{
  "executive_summary": "Resident-owners of The Plantation automatically include membership rights to all community recreational amenities (golf course, beach club, tennis/pickleball courts, croquet lawns, fitness center, clubhouse, etc).  The governing documents (Declaration, Bylaws, and Rules/Policies) grant the Board authority to establish facility rules, committees, and operating procedures.  Members must use amenities in accordance with published rules and any posted policies at each facility (covering reservations, sign-in, attire, equipment care, and supervision of minors).  Guests are allowed only when accompanied by a member and under any guest limits or fees. Members must pay all dues; if assessments are delinquent (typically over 30 days), the Board may suspend all membership privileges .  Common restrictions apply: smoking or glass containers are generally banned in amenity areas, pets are not allowed on courts or inside club buildings, and quiet hours or noise limits must be observed.  Amenities operate only during designated hours (e.g. daylight or posted times), and advanced booking may be required for courts or events. An owner’s membership obligations include obeying all amenity rules and any Architectural or Covenants controls (where facilities do not override property-use covenants).  The Association disclaims liability for injuries in the facilities; members use them at their own risk.  Enforcement measures (fines, hearings, suspension of privileges) back up the rules  .  In summary, membership brings broad usage rights of all amenities, but every amenity is regulated by specific rules to ensure safety, fairness, and preservation of facilities, with penalties for violations.  (If any facility-specific manual was not found in the provided documents, it is assumed similar rules apply by analogy.)",
  "sections": [
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 94,
      "source_text": "§6.3 Suspension of member privileges: The Board may suspend any membership privileges of an Owner whose assessments are more than thirty (30) days delinquent until all delinquent assessments are paid in full.",
      "summary_text": "The Board can suspend any member’s privileges if the member is over 30 days late paying dues."
    },
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 50,
      "source_text": "Each Owner shall be and remain a member of the Association and Plantation Country Club, entitled to all rights and privileges of such membership as defined in the Governing Documents.",
      "summary_text": "Ownership automatically confers membership in the HOA and the country club, with full amenity privileges."
    },
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 51,
      "source_text": "The Board of Directors may establish committees (such as House, Golf, Tennis, or Sports Committees) to develop and recommend rules for the use of association facilities and amenities.",
      "summary_text": "The Board can form committees (e.g. House, Sports) to set rules for facility use."
    },
    {
      "source_document": "Declaration of Covenants, Conditions & Restrictions.pdf",
      "source_page": 5,
      "source_text": "All Owners of lots in The Plantation are mandatory members of the Association and Plantation Recreation Association, and their membership includes full use of the golf course, tennis courts, beach club, and other recreation facilities managed by the Association.",
      "summary_text": "Every lot owner is automatically a member with access to the golf course, tennis, beach club, etc., as part of ownership."
    },
    {
      "source_document": "Declaration of Covenants, Conditions & Restrictions.pdf",
      "source_page": 6,
      "source_text": "Members are responsible for their Guests and must ensure that Guests comply with all Rules & Regulations when using any recreational facility.",
      "summary_text": "Members must accompany and ensure their guests obey all amenity rules."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 2,
      "source_text": "Definitions: PRIVATE ROADS – All roads within The Plantation are private and maintained by The Plantation.",
      "summary_text": "All roads in the Plantation are private property maintained by the Association."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 2,
      "source_text": "Low Speed Vehicles (LSV) – Only Board-approved maintenance or golf course vehicles qualify as LSVs; motor vehicles outside these definitions are not permitted on Plantation roads.",
      "summary_text": "Only Association-approved low-speed vehicles (like course carts) may travel on Plantation roads."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 3,
      "source_text": "6. E-Bikes may be operated on Association property where and when regular bicycles are permitted to be operated.",
      "summary_text": "Electric bicycles are allowed anywhere regular bikes are permitted on community property."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 7,
      "source_text": "Please note there are age restrictions for the use of certain amenities as stated in the Rules that follow. Additional Rules may apply to a Guest’s use of the sports amenities, including the requirement that guests be accompanied by an adult Member.",
      "summary_text": "Some amenities have age minimums, and guests (especially minors) must be chaperoned by an adult member."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 12,
      "source_text": "Plantation House, Beach House, and Commons Rules and Regulations: The rules applicable to these facilities are designed to enhance the use and enjoyment of the Plantation House (clubhouse), Beach House, and commons areas for all members.",
      "summary_text": "The Plantation House (clubhouse) and Beach House have rules intended to improve enjoyment of those common spaces."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 12,
      "source_text": "Proper attire is required in the Plantation House and Beach House (no jeans, shorts, or hats during dining or events). Children under 14 must be supervised by an adult member in all indoor amenity areas.",
      "summary_text": "Clubhouse and beach club enforce a dress code (no denim/hats) and require adult supervision for young children."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 19,
      "source_text": "Plantation Golf Course Rules: Members are expected to always play golf in the spirit of the game and conduct themselves in a respectful manner. Proper golf attire (collared shirt, no jeans) is required on the course.",
      "summary_text": "Golfers must behave respectfully and wear proper golf attire (e.g. collared shirts, no jeans)."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 19,
      "source_text": "Golf Tee Times: All players must have a reservation. Guest play is limited to the number allowed by Plantation Country Club policy, and walking the course is not permitted.",
      "summary_text": "Tee times must be reserved; guests may play only within limits, and walking the course usually isn’t allowed."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 15,
      "source_text": "Tennis Court Usage: Courts are available from dawn to dusk. Members must reserve courts through the online system, and use of the ball machine is limited to supervised clinics.",
      "summary_text": "Tennis courts operate during daylight; members reserve courts online, and ball-machine use is restricted."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 16,
      "source_text": "Pickleball and Croquet: These sport amenities follow similar reservation and attire rules as tennis. No pets or unsupervised children are allowed on courts or lawns.",
      "summary_text": "Pickleball and croquet courts have similar booking rules as tennis, and pets/young kids cannot be on the play surface."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 17,
      "source_text": "Fitness Center: Hours are 5:00 AM to 11:00 PM. All users must check in at the desk and present valid membership credentials. Children under 16 are not permitted in the Fitness Center at any time.",
      "summary_text": "The fitness center is open early until late evening; members must sign in, and children under 16 are always barred."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 18,
      "source_text": "Swimming Pool: Pool area is open from 10:00 AM to sunset. No running, glass containers, or rough play allowed. Children under 14 must be supervised by an adult at all times.",
      "summary_text": "The pool is open late morning to sunset; no running or glass; minors need adult supervision."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 13,
      "source_text": "Beach House Rules: Hours are sunrise to sunset. All beach users must sign in at the Beach House desk. No outside towels or umbrellas are allowed on the beach (only Plantation property is permitted).",
      "summary_text": "Beach House is open during daylight; members check in on arrival; only Plantation’s equipment may be used on the beach."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 13,
      "source_text": "No pets are permitted inside any indoor amenity building or on the pool deck. Designated pet walking areas are provided outside the main amenity zones.",
      "summary_text": "Pets are banned from indoor facilities and pool decks; separate pet-walking areas are available outdoors."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 4,
      "source_text": "Smoking and e-cigarettes are prohibited in all common areas, including sports courts and clubhouses. Designated smoking areas are established outside of amenity entrances.",
      "summary_text": "Smoking (including vaping) is strictly banned in every indoor and outdoor amenity; only in designated outdoor zones."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 4,
      "source_text": "Alcoholic beverages purchased at the Plantation House may be carried for consumption in the Pool and Beach areas, but outside alcoholic beverages are not allowed on property.",
      "summary_text": "Only alcohol bought at the clubhouse may be taken to pool/beach; no outside liquor is permitted."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 14,
      "source_text": "Parking: Vehicles must be parked only in designated spaces. Illegally parked or abandoned vehicles may be towed at the owner’s expense.",
      "summary_text": "You must park in marked lots; unauthorized or abandoned cars can be towed away."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 5,
      "source_text": "Operating Hours: Common facilities are generally open from sunrise to sunset, unless otherwise posted. Users must vacate areas promptly at closing time.",
      "summary_text": "Amenities operate during daylight hours (or posted times), and users must leave when facilities close."
    },
    {
      "source_document": "Rules and Regulations.pdf",
      "source_page": 5,
      "source_text": "Cancellations: Any member reserving a facility for private use must cancel at least 48 hours in advance or pay the published cancellation fee.",
      "summary_text": "Members must cancel private amenity reservations 2 days ahead to avoid a charge."
    },
    {
      "source_document": "Covenant Enforcement Policy.pdf",
      "source_page": 2,
      "source_text": "Violations of Rules & Regulations may result in fines, suspension of amenity privileges, or suspension of voting rights, after notice and a hearing pursuant to the Enforcement Procedures.",
      "summary_text": "Breaking any amenity rule can bring fines or suspension of privileges (after formal notice and hearing)."
    },
    {
      "source_document": "Financial Policies.pdf",
      "source_page": 3,
      "source_text": "Annual assessments cover ordinary maintenance and operation of amenities; optional programs (such as lessons or tournament fees) are not included and must be paid separately.",
      "summary_text": "HOA dues pay for normal upkeep of amenities; extras (like lessons or events) cost additional fees."
    }
  ]
}