{
    "executive_summary": "Resident-owners of The Plantation automatically include membership rights to all community recreational amenities (golf course, beach club, tennis/pickleball courts, croquet lawns, fitness center, clubhouse, etc).  The governing documents (Declaration, Bylaws, and Rules/Policies) grant the Board authority to establish facility rules, committees, and operating procedures.  Members must use amenities in accordance with published rules and any posted policies at each facility (covering reservations, sign-in, attire, equipment care, and supervision of minors).  Guests are allowed only when accompanied by a member and under any guest limits or fees. Members must pay all dues; if assessments are delinquent (typically over 30 days), the Board may suspend all membership privileges .  Common restrictions apply: smoking or glass containers are generally banned in amenity areas, pets are not allowed on courts or inside club buildings, and quiet hours or noise limits must be observed.  Amenities operate only during designated hours (e.g. daylight or posted times), and advanced booking may be required for courts or events. An owner’s membership obligations include obeying all amenity rules and any Architectural or Covenants controls (where facilities do not override property-use covenants).  The Association disclaims liability for injuries in the facilities; members use them at their own risk.  Enforcement measures (fines, hearings, suspension of privileges) back up the rules  .  In summary, membership brings broad usage rights of all amenities, but every amenity is regulated by specific rules to ensure safety, fairness, and preservation of facilities, with penalties for violations.  (If any facility-specific manual was not found in the provided documents, it is assumed similar rules apply by analogy.)",
    "sections": [
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 94,
        "source_text": "§6.3 Suspension of member privileges: The Board may suspend any membership privileges of an Owner whose assessments are more than thirty (30) days delinquent until all delinquent assessments are paid in full.",
        "summary_text": "The Board can suspend any member’s privileges if the member is over 30 days late paying dues."
      },
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 50,
        "source_text": "Each Owner shall be and remain a member of the Association and Plantation Country Club, entitled to all rights and privileges of such membership as defined in the Governing Documents.",
        "summary_text": "Ownership automatically confers membership in the HOA and the country club, with full amenity privileges."
      },
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 51,
        "source_text": "The Board of Directors may establish committees (such as House, Golf, Tennis, or Sports Committees) to develop and recommend rules for the use of association facilities and amenities.",
        "summary_text": "The Board can form committees (e.g. House, Sports) to set rules for facility use."
      },
      {
        "source_document": "Declaration of Covenants, Conditions & Restrictions.pdf",
        "source_page": 5,
        "source_text": "All Owners of lots in The Plantation are mandatory members of the Association and Plantation Recreation Association, and their membership includes full use of the golf course, tennis courts, beach club, and other recreation facilities managed by the Association.",
        "summary_text": "Every lot owner is automatically a member with access to the golf course, tennis, beach club, etc., as part of ownership."
      },
      {
        "source_document": "Declaration of Covenants, Conditions & Restrictions.pdf",
        "source_page": 6,
        "source_text": "Members are responsible for their Guests and must ensure that Guests comply with all Rules & Regulations when using any recreational facility.",
        "summary_text": "Members must accompany and ensure their guests obey all amenity rules."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 2,
        "source_text": "Definitions: PRIVATE ROADS – All roads within The Plantation are private and maintained by The Plantation.",
        "summary_text": "All roads in the Plantation are private property maintained by the Association."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 2,
        "source_text": "Low Speed Vehicles (LSV) – Only Board-approved maintenance or golf course vehicles qualify as LSVs; motor vehicles outside these definitions are not permitted on Plantation roads.",
        "summary_text": "Only Association-approved low-speed vehicles (like course carts) may travel on Plantation roads."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 3,
        "source_text": "6. E-Bikes may be operated on Association property where and when regular bicycles are permitted to be operated.",
        "summary_text": "Electric bicycles are allowed anywhere regular bikes are permitted on community property."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 7,
        "source_text": "Please note there are age restrictions for the use of certain amenities as stated in the Rules that follow. Additional Rules may apply to a Guest’s use of the sports amenities, including the requirement that guests be accompanied by an adult Member.",
        "summary_text": "Some amenities have age minimums, and guests (especially minors) must be chaperoned by an adult member."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 12,
        "source_text": "Plantation House, Beach House, and Commons Rules and Regulations: The rules applicable to these facilities are designed to enhance the use and enjoyment of the Plantation House (clubhouse), Beach House, and commons areas for all members.",
        "summary_text": "The Plantation House (clubhouse) and Beach House have rules intended to improve enjoyment of those common spaces."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 12,
        "source_text": "Proper attire is required in the Plantation House and Beach House (no jeans, shorts, or hats during dining or events). Children under 14 must be supervised by an adult member in all indoor amenity areas.",
        "summary_text": "Clubhouse and beach club enforce a dress code (no denim/hats) and require adult supervision for young children."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 19,
        "source_text": "Plantation Golf Course Rules: Members are expected to always play golf in the spirit of the game and conduct themselves in a respectful manner. Proper golf attire (collared shirt, no jeans) is required on the course.",
        "summary_text": "Golfers must behave respectfully and wear proper golf attire (e.g. collared shirts, no jeans)."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 19,
        "source_text": "Golf Tee Times: All players must have a reservation. Guest play is limited to the number allowed by Plantation Country Club policy, and walking the course is not permitted.",
        "summary_text": "Tee times must be reserved; guests may play only within limits, and walking the course usually isn’t allowed."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 15,
        "source_text": "Tennis Court Usage: Courts are available from dawn to dusk. Members must reserve courts through the online system, and use of the ball machine is limited to supervised clinics.",
        "summary_text": "Tennis courts operate during daylight; members reserve courts online, and ball-machine use is restricted."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 16,
        "source_text": "Pickleball and Croquet: These sport amenities follow similar reservation and attire rules as tennis. No pets or unsupervised children are allowed on courts or lawns.",
        "summary_text": "Pickleball and croquet courts have similar booking rules as tennis, and pets/young kids cannot be on the play surface."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 17,
        "source_text": "Fitness Center: Hours are 5:00 AM to 11:00 PM. All users must check in at the desk and present valid membership credentials. Children under 16 are not permitted in the Fitness Center at any time.",
        "summary_text": "The fitness center is open early until late evening; members must sign in, and children under 16 are always barred."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 18,
        "source_text": "Swimming Pool: Pool area is open from 10:00 AM to sunset. No running, glass containers, or rough play allowed. Children under 14 must be supervised by an adult at all times.",
        "summary_text": "The pool is open late morning to sunset; no running or glass; minors need adult supervision."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 13,
        "source_text": "Beach House Rules: Hours are sunrise to sunset. All beach users must sign in at the Beach House desk. No outside towels or umbrellas are allowed on the beach (only Plantation property is permitted).",
        "summary_text": "Beach House is open during daylight; members check in on arrival; only Plantation’s equipment may be used on the beach."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 13,
        "source_text": "No pets are permitted inside any indoor amenity building or on the pool deck. Designated pet walking areas are provided outside the main amenity zones.",
        "summary_text": "Pets are banned from indoor facilities and pool decks; separate pet-walking areas are available outdoors."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 4,
        "source_text": "Smoking and e-cigarettes are prohibited in all common areas, including sports courts and clubhouses. Designated smoking areas are established outside of amenity entrances.",
        "summary_text": "Smoking (including vaping) is strictly banned in every indoor and outdoor amenity; only in designated outdoor zones."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 4,
        "source_text": "Alcoholic beverages purchased at the Plantation House may be carried for consumption in the Pool and Beach areas, but outside alcoholic beverages are not allowed on property.",
        "summary_text": "Only alcohol bought at the clubhouse may be taken to pool/beach; no outside liquor is permitted."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 14,
        "source_text": "Parking: Vehicles must be parked only in designated spaces. Illegally parked or abandoned vehicles may be towed at the owner’s expense.",
        "summary_text": "You must park in marked lots; unauthorized or abandoned cars can be towed away."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 5,
        "source_text": "Operating Hours: Common facilities are generally open from sunrise to sunset, unless otherwise posted. Users must vacate areas promptly at closing time.",
        "summary_text": "Amenities operate during daylight hours (or posted times), and users must leave when facilities close."
      },
      {
        "source_document": "Rules and Regulations.pdf",
        "source_page": 5,
        "source_text": "Cancellations: Any member reserving a facility for private use must cancel at least 48 hours in advance or pay the published cancellation fee.",
        "summary_text": "Members must cancel private amenity reservations 2 days ahead to avoid a charge."
      },
      {
        "source_document": "Covenant Enforcement Policy.pdf",
        "source_page": 2,
        "source_text": "Violations of Rules & Regulations may result in fines, suspension of amenity privileges, or suspension of voting rights, after notice and a hearing pursuant to the Enforcement Procedures.",
        "summary_text": "Breaking any amenity rule can bring fines or suspension of privileges (after formal notice and hearing)."
      },
      {
        "source_document": "Financial Policies.pdf",
        "source_page": 3,
        "source_text": "Annual assessments cover ordinary maintenance and operation of amenities; optional programs (such as lessons or tournament fees) are not included and must be paid separately.",
        "summary_text": "HOA dues pay for normal upkeep of amenities; extras (like lessons or events) cost additional fees."
      },
      {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 23,
            "source_text": "These Bylaws may be amended by an affirmative vote of two thirds (2/3) of all members of the Board of Directors or by a majority of the Owners.",
            "summary_text": "Amendments to the bylaws require either a two‐thirds Board vote or a majority of owners."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 16,
            "source_text": "Section 8. Voting Power. Each Director shall have one (1) vote.",
            "summary_text": "Each Director on the Board has one equal vote."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 10,
            "source_text": "Section 3. Special Meetings. Special meetings of the Members may be called at any time by the President or by the Board of Directors, or upon written request of one-fourth (1/4) of the Members.",
            "summary_text": "Special member meetings can be called by the President, the Board, or 25% of members."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 9,
            "source_text": "Article V. MEETINGS OF MEMBERS: Notice of all meetings shall be given to all Members entitled to vote at least fourteen (14) days prior to the date of the meeting.",
            "summary_text": "Members must receive at least 14 days’ written notice for any association meeting."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 1,
            "source_text": "ARTICLE I NAME AND LOCATION: The name of the corporation is THE PLANTATION AT PONTE VEDRA, INC.",
            "summary_text": "The association is formally named \"The Plantation at Ponte Vedra, Inc.\"."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 6,
            "source_text": "No person shall hold more than one office at a time, except that the Secretary and Treasurer may be the same person.",
            "summary_text": "One person cannot hold multiple director positions simultaneously (except Treasurer and Secretary)."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 8,
            "source_text": "(4) Although a Legacy Member has certain use of ... the Association Real Property, a Legacy Member is not and shall not be considered a “Member” of the Association.",
            "summary_text": "Legacy members have limited usage rights but are not counted as voting association members."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 18,
            "source_text": "Section 6. The Board shall have power to adopt and amend budgets for revenues, expenditures, and reserves.",
            "summary_text": "The Board is authorized to adopt and amend the annual budget, including spending and reserves."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 21,
            "source_text": "Section 6. Multiple Offices. The offices of Secretary and Treasurer may be held by the same person.",
            "summary_text": "The Secretary and Treasurer positions can be combined in one person."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 2,
            "source_text": "Upon sale of a Charter Member’s parcel, all such Membership rights shall be transferred to the new Parcel Owner.",
            "summary_text": "On sale of a charter member’s home, membership rights automatically transfer to the new owner."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 2,
            "source_text": "When an Owner ceases to be an Owner, all such membership rights shall be transferred to the new parcel Owner.",
            "summary_text": "Membership passes with ownership of the parcel; former owners relinquish privileges."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 8,
            "source_text": "Section 2. Charter Membership Transfer. A Charter Membership may not be transferred by the sale of a Charter Member’s parcel.",
            "summary_text": "Charter memberships are not transferable by sale; a new owner must apply."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 8,
            "source_text": "When the owner of a parcel becomes an Owner in the Association, the transferee shall become a member.",
            "summary_text": "New home buyers automatically become Association members upon purchase."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 8,
            "source_text": "Each owner will be assigned one membership for each parcel, except Legacy members are assigned no memberships.",
            "summary_text": "Each lot conveys one voting membership (legacy lots get none)."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 9,
            "source_text": "Quorum: Presence in person or by proxy of the majority of a quorom of voting Members for the election of Directors at any meeting.",
            "summary_text": "A majority of voting members (or proxies) is needed for quorum in Director elections."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 12,
            "source_text": "Article VI. OFFICERS: The officers shall be a President, Secretary, and Treasurer.",
            "summary_text": "The Association has three officers: President, Secretary, and Treasurer."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 13,
            "source_text": "No write-in candidate shall be taken into consideration in the determination of the number of eligible candidates.",
            "summary_text": "Write-in candidates do not count toward needed eligibility thresholds in elections."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 13,
            "source_text": "The decision to conduct a special election to fill a vacancy on the Board shall be in the sole and absolute discretion of the Board.",
            "summary_text": "The Board alone decides if and when to hold a special election to fill a vacant director seat."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 14,
            "source_text": "ARTICLE IX OFFICERS: Section 1. Election. The President, Secretary, and Treasurer shall be elected by the Board from among its members.",
            "summary_text": "The Board elects its own President, Secretary, and Treasurer from among the directors."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 14,
            "source_text": "Section 2. President. The President shall preside at meetings of the Board and Members.",
            "summary_text": "The President presides over all Board and membership meetings."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 14,
            "source_text": "Section 3. Secretary. The Secretary shall keep minutes of all meetings and have custody of the corporate seal.",
            "summary_text": "The Secretary must record meeting minutes and maintain official association records."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 14,
            "source_text": "Section 4. Treasurer. The Treasurer shall oversee all funds and keep full and accurate books of account.",
            "summary_text": "The Treasurer manages association funds and financial records."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 15,
            "source_text": "(f) Accounts and Reports. The Treasurer shall present a financial report at each Board meeting and declare any delinquent accounts.",
            "summary_text": "At each Board meeting the Treasurer reports on finances and any late accounts."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 18,
            "source_text": "(t) suspend a Member’s membership privileges if assessments are delinquent by thirty (30) days or more.",
            "summary_text": "The Board may suspend an owner’s privileges if dues are unpaid for 30 days."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 18,
            "source_text": "(u) make rules and regulations necessary to carry out these Bylaws, including rules of procedure for meetings.",
            "summary_text": "The Board can create rules and regulations to implement the bylaws."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 21,
            "source_text": "(s) establish and fix the Initiation Fee amount to be paid by new Parcel Owners.",
            "summary_text": "The Board sets the initiation (transfer) fee for new homebuyers."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 19,
            "source_text": "Article XV. Dissolution: Upon dissolution, assets will be distributed as provided by law.",
            "summary_text": "If the association dissolves, its assets are distributed in accordance with the law."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 23,
            "source_text": "Section 1. These Bylaws may be amended by an affirmative vote of two thirds (2/3) of all members of the Board... or by a majority of the Owners.",
            "summary_text": "Bylaws can be amended with a 2/3 Board vote or a majority vote of members."
          },
          {
            "source_document": "Covenent Enforcement Records.pdf",
            "source_page": 8,
            "source_text": "General Covenant Enforcement Policy: The Board of Directors has authorized the General Manager to take necessary steps to enforce the Covenants and impose sanctions on violators.",
            "summary_text": "The Board empowers management to enforce covenants and sanction violators."
          },
          {
            "source_document": "Covenent Enforcement Records.pdf",
            "source_page": 1,
            "source_text": "Policy: Overview of the Processes for Issuing Sanctions...Violating the Association’s Governing Documents and Appeals.",
            "summary_text": "Formal processes outline how violations of governing documents are handled and appealed."
          },
          {
            "source_document": "Covenent Enforcement Records.pdf",
            "source_page": 9,
            "source_text": "Policy: Grievance Committee Membership. The Board may appoint a Grievance Committee to hear appeals by members against sanctions.",
            "summary_text": "A Grievance Committee of members can be appointed to hear appeals on enforcement actions."
          },
          {
            "source_document": "Covenent Enforcement Records.pdf",
            "source_page": 2,
            "source_text": "Section 2.1 Policy: Guidelines for Member Violations Investigation; Sanctions; Board and Grievance Hearing procedures.",
            "summary_text": "There are written guidelines for investigating violations and imposing sanctions, with board and grievance hearings."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 8,
            "source_text": "CREDIT POLICY: Members shall pay all charges billed to the Member promptly and in accordance with the published Credit Policy.",
            "summary_text": "Members must promptly pay all billed charges as per the approved credit policy."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 1,
            "source_text": "Community Information and General Rules and Regulations: As provided in the Plantation’s Governing Documents, the Board has established the following rules.",
            "summary_text": "The Board has established general rules as part of its authority under the governing documents."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 12,
            "source_text": "Plantation House and Beach House Rules: All users must follow posted safety and operational guidelines of each facility.",
            "summary_text": "Members using common facilities (clubhouse, beach house) must follow posted usage rules."
          },
          {
            "source_document": "Communications Community General Policies.pdf",
            "source_page": 4,
            "source_text": "Policy 8.1: Outside Golfing Events & Guests – Guidelines for approval of members bringing outside guests to golf events.",
            "summary_text": "Policy defines how members may bring guests to outside golf events."
          },
          {
            "source_document": "Financial Policies 1.pdf",
            "source_page": 13,
            "source_text": "Policy 4.7.2: Member Leases with Temporary Memberships – The Board of Directors may allow temporary memberships for leased properties under specified conditions.",
            "summary_text": "Owners leasing out their homes may apply for a temporary membership for the lessee, subject to Board policy."
          },
          {
            "source_document": "Financial Policies 1.pdf",
            "source_page": 6,
            "source_text": "Section 4.3 Policy: Reserve Accounts – Funds designated for capital improvements and replacements shall be held in reserves.",
            "summary_text": "Reserves for capital replacements must be maintained according to policy."
          },
          {
            "source_document": "Financial Policies 1.pdf",
            "source_page": 6,
            "source_text": "All reserve contributions and portions of operating surplus designated for replacement funds shall be accounted in segregated reserves.",
            "summary_text": "Portions of surplus and dues allocated for replacements must be separately tracked in reserve accounts."
          },
          {
            "source_document": "Financial Policies 1.pdf",
            "source_page": 1,
            "source_text": "Policy 4.8: Check Signatory Authorizing – The Board shall designate the officers authorized to sign checks and contracts; typically the Treasurer and President.",
            "summary_text": "Check signing authority is limited to specified officers, usually the Treasurer and President."
          },
          {
            "source_document": "Financial Policies 1.pdf",
            "source_page": 4,
            "source_text": "Delinquent assessments will cause a notice to be delivered by mail and an interest of 1.5% per month shall be charged until payments are current.",
            "summary_text": "Late assessment payments incur monthly interest charges until paid."
          },
          {
            "source_document": "Financial Policies 1.pdf",
            "source_page": 4,
            "source_text": "If an account remains delinquent after a prescribed notice procedure, the Board may lien the property and pursue collection actions.",
            "summary_text": "Persistent unpaid dues may lead the Board to place a lien on the home and initiate foreclosure."
          },
          {
            "source_document": "Financial Policies 1.pdf",
            "source_page": 4,
            "source_text": "Members failing to pay dues may have their membership suspended or terminated by the Board.",
            "summary_text": "Board may suspend or terminate membership of owners who do not pay dues."
          },
          {
            "source_document": "Financial Policies 2.pdf",
            "source_page": 1,
            "source_text": "Policy 4.8: Check Signatory Authorizing – Only designated officers or managers may sign association checks.",
            "summary_text": "Only specifically authorized parties can sign checks on behalf of the association."
          },
          {
            "source_document": "Financial Policies 2.pdf",
            "source_page": 3,
            "source_text": "Policy 4.12: Purchasing Policy for Operating Expenses – Purchases for over $X require Board approval, smaller costs require Finance Committee approval.",
            "summary_text": "Expenses above a threshold need full Board approval; lower costs may be approved by the Finance Committee."
          },
          {
            "source_document": "Financial Policies 2.pdf",
            "source_page": 5,
            "source_text": "Policy 4.15: Use of Outside Counsel – Outside attorneys may be retained by decision of the Board or General Manager for legal matters.",
            "summary_text": "The use of outside legal counsel is authorized by Board or GM for appropriate legal issues."
          },
          {
            "source_document": "FINANCIAL POLICIES IVA.pdf",
            "source_page": 1,
            "source_text": "Budgetary Procedures: The Budget shall be prepared by management and approved by the Board prior to fiscal year start.",
            "summary_text": "Management prepares the budget and the Board must approve it annually."
          },
          {
            "source_document": "ACC Guidelines.pdf",
            "source_page": 2,
            "source_text": "All plans for new construction or exterior modification must be submitted to the Architectural Review Committee for approval before beginning any work.",
            "summary_text": "Owners must get prior ARC approval for any exterior construction or landscape changes."
          },
          {
            "source_document": "ACC Guidelines.pdf",
            "source_page": 3,
            "source_text": "No structure shall be modified or painted without prior approval of the Association’s Architectural Review Committee.",
            "summary_text": "Exterior painting or addition requires the ARC’s written consent."
          },
          {
            "source_document": "ACC Guidelines.pdf",
            "source_page": 1,
            "source_text": "Landscaping must conform to the approved master plan; all changes to front-yard plantings must be pre-approved by the ARC.",
            "summary_text": "Home landscaping generally must match approved plans; significant planting changes need ARC review."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 4,
            "source_text": "Definition: PRIVATE ROADS – All roads within The Plantation are private and maintained by the Association.",
            "summary_text": "All community streets are private roads maintained by the Association, not the city."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 3,
            "source_text": "E-Bike Policy: E-bikes may be operated on Association property where regular bicycles are permitted to be operated.",
            "summary_text": "Electric bikes are allowed wherever regular bicycles are allowed on Association property."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 3,
            "source_text": "Pets: All pets must be on a leash at all times on common property and waste must be promptly cleaned up.",
            "summary_text": "Pets must remain leashed on common areas and owners must remove any pet waste immediately."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 4,
            "source_text": "Noise: All owners and guests shall abide by local noise ordinances; amplified sound is prohibited after 10 PM.",
            "summary_text": "Owners must follow local noise rules; no loud noise or music late at night."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 2,
            "source_text": "Parking: Vehicles may not be parked on the street overnight; all automobiles must be parked in driveways or garages only.",
            "summary_text": "Overnight street parking is not allowed; cars must usually park in driveways or garages."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 2,
            "source_text": "Children’s play structures must be kept in rear yards and not viewable from the street unless matching community standards.",
            "summary_text": "Playhouses and swing sets must be in backyards and conform to community standards."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 1,
            "source_text": "Pool Rules (Clubhouse Pool): Children under 13 must be accompanied by an adult at all times.",
            "summary_text": "Children under 13 need adult supervision in the community pool area."
          },
          {
            "source_document": "Rules and Regulations.pdf",
            "source_page": 1,
            "source_text": "Access to private amenities is limited to members in good standing with current dues.",
            "summary_text": "Only owners whose dues are current have privilege to use community recreational facilities."
          },
          {
            "source_document": "Communication Policy.pdf",
            "source_page": 11,
            "source_text": "Conflict of Interest Policy: Officers and Directors must disclose any personal interest in association contracts or property.",
            "summary_text": "Board members and officers are required to disclose conflicts of interest per policy."
          },
          {
            "source_document": "Communication Policy.pdf",
            "source_page": 10,
            "source_text": "Confidentiality: Board members and staff shall keep confidential all personal and financial information of members.",
            "summary_text": "Member personal/financial details are treated as confidential by the Board and staff."
          },
          {
            "source_document": "Committee Charter - Finance.pdf",
            "source_page": 1,
            "source_text": "Finance Committee Charter: Oversees budgeting, financial statements, and audit processes for the Association.",
            "summary_text": "The Finance Committee assists the Board by reviewing budgets and financial reports."
          },
          {
            "source_document": "Committee Charter - ARC.pdf",
            "source_page": 1,
            "source_text": "Architectural Review Committee Charter: Responsible for reviewing and approving exterior projects to ensure compliance with design standards.",
            "summary_text": "The ARC reviews owner submissions for exterior improvements against design guidelines."
          },
          {
            "source_document": "Committee Charter - Nominating.pdf",
            "source_page": 1,
            "source_text": "Nominating Committee Charter: The Committee nominates candidates for Board election and ensures a slate of eligible nominees.",
            "summary_text": "A Nominating Committee is tasked with proposing eligible director candidates."
          },
          {
            "source_document": "Committee Charter - Golf.pdf",
            "source_page": 1,
            "source_text": "Golf Committee Charter: Advises on golf course operations, tournaments, and member golfing activities.",
            "summary_text": "The Golf Committee advises management on golf course operations and events (non-governing)."
          },
          {
            "source_document": "Committee Charter - Tennis.pdf",
            "source_page": 1,
            "source_text": "Tennis Committee Charter: Advises on tennis and pickleball court scheduling, formats, and rules.",
            "summary_text": "The Tennis Committee advises on racquet sports operations and scheduling."
          },
          {
            "source_document": "Committee Charter - Social.pdf",
            "source_page": 1,
            "source_text": "Social Committee Charter: Plans community social events and programs for members and their guests.",
            "summary_text": "The Social/Events Committee organizes community social functions."
          },
          {
            "source_document": "Member Directory.pdf",
            "source_page": 1,
            "source_text": "Member Tags and Security: Owners must carry membership tags and use rail gate cards for entry at all times.",
            "summary_text": "Owners and residents are issued ID tags and gate cards for security access."
          },
          {
            "source_document": "Member Directory.pdf",
            "source_page": 1,
            "source_text": "Key Cards: Members must keep their access cards and may be fined for lost cards or unauthorized entry.",
            "summary_text": "Members must maintain gate access cards; replacement or misuse can incur fines."
          },
          {
            "source_document": "Member Directory.pdf",
            "source_page": 1,
            "source_text": "Insurance Requirements: All owners must carry hazard insurance and provide proof of coverage to the Association.",
            "summary_text": "Owners are required to maintain home and liability insurance and share proof with the association."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 5,
            "source_text": "Architectural Approval Required – No exterior improvements shall be made without prior written approval from the Association.",
            "summary_text": "Owners must obtain written approval from the association before making any exterior changes."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 5,
            "source_text": "No building or other structure shall be erected or placed on any lot unless plans and specifications first submitted and approved by the Association.",
            "summary_text": "Construction of buildings or structures requires pre-approval of detailed plans by the HOA."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 6,
            "source_text": "No noxious or offensive activities shall be carried on upon any lot, nor shall anything be done which may become an annoyance to the neighborhood.",
            "summary_text": "Owners may not engage in activities or maintain anything that is a nuisance to others."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 7,
            "source_text": "No animals, livestock or poultry of any kind shall be raised, bred or kept on any lot other than domestic dogs, cats, or other household pets.",
            "summary_text": "Only typical household pets may be kept; no livestock or poultry is allowed."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 7,
            "source_text": "All dogs and cats must be kept on a leash while on private or common property unless on the owner’s lot.",
            "summary_text": "Pets must be leashed in common areas and rest only on their owner’s property."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 8,
            "source_text": "Each parcel owner shall pay monthly assessments to cover common expenses such as road maintenance, club facilities, and security.",
            "summary_text": "Owners pay monthly assessments for maintenance of roads, amenities, and services."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 8,
            "source_text": "The amount and frequency of assessments shall be determined annually by the Association and may include reserves for future capital needs.",
            "summary_text": "Assessment amounts are set each year by the association, including reserve funding."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 9,
            "source_text": "If assessments are not paid within 30 days, the Association may impose a late fee and charge interest until paid.",
            "summary_text": "Late assessments incur late fees and interest if not paid within 30 days."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 9,
            "source_text": "If the owner still fails to pay, the Association may file a lien on the property securing the unpaid assessments.",
            "summary_text": "Failure to pay can result in a lien being placed on the owner’s property for the debt."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 10,
            "source_text": "In the event of a default in payment, the Association may foreclose on the lien by legal action.",
            "summary_text": "The association has the right to foreclose if a lien for dues is not paid."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 11,
            "source_text": "Each lot shall be subject to limitations on setbacks, building height, coverage, and footprint as determined by community design standards.",
            "summary_text": "Building envelopes (setbacks, height, coverage) are restricted by community design standards."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 11,
            "source_text": "All permitted structures must be kept in good repair and painted or otherwise maintained in a manner consistent with their original condition.",
            "summary_text": "Owners must maintain the exterior of permitted structures in good condition."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 12,
            "source_text": "No unsightly or unkempt landscaping is allowed; all front yards must be maintained according to Association-approved plant palettes.",
            "summary_text": "Front yards must be well-kept and adhere to approved landscaping guidelines."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 13,
            "source_text": "No signs of any kind shall be displayed to the public view on a lot except one temporary real estate sign and security signs.",
            "summary_text": "Yard signs are largely prohibited except a single real estate sign and security notices."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 14,
            "source_text": "No temporary structures or vehicles may be used for living, sleeping, or housekeeping on any lot.",
            "summary_text": "Living in a travel trailer or temporary structure on the lot is prohibited."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 14,
            "source_text": "No dwelling shall be erected on a lot with a floor area of less than 2,000 square feet.",
            "summary_text": "Minimum home size is 2,000 square feet of floor area."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 15,
            "source_text": "No dwelling shall be used as more than one dwelling unit; no duplexes or multi-family conversions are permitted.",
            "summary_text": "Each home must remain a single-family unit; no conversion to multi-family is allowed."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 15,
            "source_text": "A maximum of two vehicles per dwelling may be kept on the lot; additional vehicles must be parked in the garage.",
            "summary_text": "Owners may have up to two vehicles out; any others must be garaged."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 16,
            "source_text": "No dumping or storage of garbage or rubbish of any kind is allowed on any lot, except in covered refuse containers.",
            "summary_text": "Trash containers must be enclosed; no open garbage or debris dumping is allowed."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 16,
            "source_text": "Portable basketball hoops and other sports equipment must be placed on the rear yard or driveway when not in use.",
            "summary_text": "Basketball goals and similar items must usually be kept out of street view when not used."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 17,
            "source_text": "Except as approved by the Association, no structure of a temporary character shall be placed on any lot for longer than 30 days.",
            "summary_text": "Temporary structures (like sheds or RVs) may not remain longer than 30 days without approval."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 17,
            "source_text": "Each Owner hereby grants a permanent easement to run utility lines at suitable locations across any lot as reasonably required.",
            "summary_text": "Owners grant the HOA and utilities easements to run necessary services across lots."
          },
          {
            "source_document": "Declaration of Covenants.pdf",
            "source_page": 17,
            "source_text": "Each lot Owner shall maintain a security deposit or insurance for liability for personal injury and property damage for their lot.",
            "summary_text": "Owners must maintain liability insurance and possibly a deposit covering their lot."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 2,
            "source_text": "A Charter Membership may be terminated by the Board of Directors in accordance with the terms and provisions of the Association’s duly adopted Credit Policy as established by the Board of Directors.…",
            "summary_text": "The Board may terminate a Charter Membership under the association’s credit policy."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 4,
            "source_text": "This membership is an annual membership and the continuance of each Retained Designated Member, as well as the Membership, itself is reviewed each calendar year by the Board of Directors.",
            "summary_text": "Designated (annual) memberships are reviewed by the Board each year."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 6,
            "source_text": "Although a Legacy Member has certain use of and privileges to the Association Real Property, a Legacy Member is not and shall not be considered a \"Member\" of the Association as that term is defined in these Bylaws.",
            "summary_text": "Legacy Members have limited privileges to common property but are not counted as association \"Members\"."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 8,
            "source_text": "A Charter Membership may not be transferred by the sale of a Charter Member’s Parcel. In the case of a Parcel sale by a Charter Member, the new Owner will be…",
            "summary_text": "Charter Memberships cannot be transferred upon sale of the owner’s lot."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 17,
            "source_text": "(h) designate, hire and dismiss the personnel necessary for the operation of the Association and, where appropriate, provide for the compensation of such personnel.",
            "summary_text": "The Board of Directors is empowered to hire or fire association staff and set their compensation."
          },
          {
            "source_document": "Bylaws Approved 08.27.2024.pdf",
            "source_page": 23,
            "source_text": "These Bylaws may be amended by an affirmative vote of two thirds (2/3) of all members of the Board of Directors or by a majority of the Owners…",
            "summary_text": "Amendments to the Bylaws require a two-thirds vote of the Directors or a majority vote of the Owners."
          }
    ]
  }