{
  "sections": [
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 2,
      "source_text": "A Charter Membership may be terminated by the Board of Directors in accordance with the terms and provisions of the Association’s duly adopted Credit Policy as established by the Board of Directors.…",
      "summary_text": "The Board may terminate a Charter Membership under the association’s credit policy."
    },
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 4,
      "source_text": "This membership is an annual membership and the continuance of each Retained Designated Member, as well as the Membership, itself is reviewed each calendar year by the Board of Directors.",
      "summary_text": "Designated (annual) memberships are reviewed by the Board each year."
    },
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 6,
      "source_text": "Although a Legacy Member has certain use of and privileges to the Association Real Property, a Legacy Member is not and shall not be considered a \"Member\" of the Association as that term is defined in these Bylaws.",
      "summary_text": "Legacy Members have limited privileges to common property but are not counted as association \"Members\"."
    },
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 8,
      "source_text": "A Charter Membership may not be transferred by the sale of a Charter Member’s Parcel. In the case of a Parcel sale by a Charter Member, the new Owner will be…",
      "summary_text": "Charter Memberships cannot be transferred upon sale of the owner’s lot."
    },
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 17,
      "source_text": "(h) designate, hire and dismiss the personnel necessary for the operation of the Association and, where appropriate, provide for the compensation of such personnel.",
      "summary_text": "The Board of Directors is empowered to hire or fire association staff and set their compensation."
    },
    {
      "source_document": "Bylaws Approved 08.27.2024.pdf",
      "source_page": 23,
      "source_text": "These Bylaws may be amended by an affirmative vote of two thirds (2/3) of all members of the Board of Directors or by a majority of the Owners…",
      "summary_text": "Amendments to the Bylaws require a two-thirds vote of the Directors or a majority vote of the Owners."
    }
  ]
}