{
    "executive_summary": "The Plantation at Ponte Vedra Beach is a deed-restricted equity community where ownership of a home automatically confers membership in the Association.  Membership rights (often called “Charter Memberships”) are tied to each parcel and cannot be sold separately.  By the bylaws, when a home is sold the membership passes to the new owner, and the board may terminate a membership for nonpayment according to the published credit policy.  Members are required to pay all Association charges (dues, fees, etc.) promptly per the credit policy.  The Association’s governing framework includes the Articles (not available for review), the Amended Bylaws, and a Declaration of Covenants (not seen in the sources), which together establish obligations such as maintaining homeowner insurance and preserving architectural standards.  In practice, the Board of Directors has broad authority: each director has one vote, and the Board “[may] exercise all powers … not expressly reserved to the Members,” subject to state law and the governing documents .  The Board is empowered to appoint committees (including a required Architectural Design Board, a Recruitment Committee, and a Grievance Committee, and an optional Executive Committee) and sets the annual budget at least 30 days before each fiscal year.  In short, the Board oversees operations, finances, committee charters and rules, while members capture rights to amenities and vote in elections.\n\nMembers must abide by published rules for all facilities.  For example, the golf course rules state that “Members … always play golf in the spirit of the game and conduct themselves in a respectful manner” .  The Plantation-wide rules specify that all roads are private and maintained by the Association, and that members must register and generally accompany their guests (guests holding approved guest cards are an exception).  During peak season (May 1–Sept 30), members may host up to six guests per day.  Each facility has its own rules: the Tennis/ Pickleball courts and Croquet lawns have hours and behavior policies (e.g. courts open at 8:30 am daily and members have priority using courts over guests), the Fitness Center requires a signed waiver before use and allows unsupervised use by age-15+ members with certification, and the Beach House/pool rules forbid bicycles on the pool deck.  Common-age restrictions apply (amenities may have age limits) and safety rules are enforced (e.g. the croquet lawn closes at sundown).\n\nViolations of rules and covenants trigger enforcement procedures.  The Association’s covenant enforcement policy (Grievance Committee Charter, etc.) provides that alleged violations are investigated and members receive notice of hearings.  Sanctions – from fines to suspension of privileges – may be imposed after a fair hearing.  For repeated or unresolved delinquencies, the rules allow suspension of membership privileges until the account is paid (statute 720.3085 is cited, e.g. suspension until 30 days after full payment).  Liens and collection measures follow nonpayment per policy.  In summary, the documents form a coherent set: the bylaws establish corporate structure and membership transfer, the Declaration (implied) and rules constrain land use and facility conduct, various committee charters and policies detail governance processes, and enforcement policies ensure compliance.  (Note: specific text from the Declaration or Articles of Incorporation was not found in the available documents.)",
    "sections": [
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 1,
        "source_text": "The name of the corporation is THE PLANTATION AT PONTE VEDRA, INC. (hereinafter referred to as the “Corporation\").",
        "summary_text": "The corporation is named The Plantation at Ponte Vedra, Inc."
      },
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 2,
        "source_text": "Upon such conveyance, all such Membership rights shall be transferred to the new Parcel Owner.",
        "summary_text": "When a property is sold, the charter membership rights automatically transfer to the new owner."
      },
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 8,
        "source_text": "A Charter Membership may not be transferred by the sale of a Charter Member’s Parcel.",
        "summary_text": "A charter membership cannot be sold or transferred separately from the parcel."
      },
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 8,
        "source_text": "A Charter Membership may be terminated by the Board of Directors in accordance with the terms and provisions of the Association’s duly adopted Credit Policy.",
        "summary_text": "The board may terminate a charter membership under the association's credit policy."
      },
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 16,
        "source_text": "Each Director shall have one (1) vote.",
        "summary_text": "Each member of the Board of Directors has one vote."
      },
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 22,
        "source_text": "The Board of Directors shall appoint an Architectural Design Board, a Recruitment Committee, and a Grievance Committee.  The Board of Directors may appoint an Executive Committee…",
        "summary_text": "The board must appoint committees (architectural, recruitment, grievance) and may establish an executive committee."
      },
      {
        "source_document": "Bylaws Approved 08.27.2024.pdf",
        "source_page": 18,
        "source_text": "At least thirty (30) days in advance of each new fiscal year, the Board of Directors shall adopt an annual budget.",
        "summary_text": "The board must adopt an annual budget at least 30 days before the fiscal year starts."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 2,
        "source_text": "PRIVATE ROADS:  All roads within The Plantation are private and maintained by The Plantation.",
        "summary_text": "All roads in the community are private and maintained by the association."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 17,
        "source_text": "A Member must register all Guests with security.  A Member must accompany all Guests except as provided with respect to those Guests who possess a Guest Card.",
        "summary_text": "Members must register all guests with security and generally accompany them, except when guests carry an authorized guest card."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 18,
        "source_text": "A Member may host a maximum of six (6) guests per day.  The number of Guests may be further limited on weekends, holidays and during special events.",
        "summary_text": "During peak season, a member may have up to six guests per day, with stricter limits on busy days (weekends, holidays)."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 8,
        "source_text": "Members shall pay all charges billed to the Member promptly and in accordance with the published Credit Policy.",
        "summary_text": "Members must promptly pay all charges billed to them, per the published credit policy."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 8,
        "source_text": "Motorcycles, etc.: No motorcycles, mopeds, motorized scooters or go-carts shall be allowed except as approved by the Board of Directors in its sole discretion.",
        "summary_text": "No motorcycles, scooters, or similar vehicles are allowed on association property without board approval."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 16,
        "source_text": "Bicycles are not permitted on the Commons lawns, playground, walking paths or the Pavilion, or on the Beach House pool deck at the Beach House, except as may be required to traverse the pool deck to the boardwalk.",
        "summary_text": "Bicycles are prohibited on the Beach House pool deck and other sensitive areas (with limited exceptions for crossing)."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 7,
        "source_text": "Please note there are age restrictions for the use of certain amenities as stated in the Rules that follow.",
        "summary_text": "Certain amenities have age restrictions as specified in the association rules."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 19,
        "source_text": "Members of the Plantation are expected to always play golf in the spirit of the game and conduct themselves in a respectful manner.",
        "summary_text": "Golfers must play in the spirit of the game and behave respectfully on the course."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 27,
        "source_text": "Members have priority for scheduling racquet courts over unaccompanied guest play.",
        "summary_text": "Members have priority scheduling on tennis/pickleball courts over guests playing alone."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 27,
        "source_text": "The courts are open for play daily.  Play starts at 8:30 a.m. and may continue under lights until close of the courts.",
        "summary_text": "Tennis and pickleball courts are open daily starting at 8:30 a.m."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 13,
        "source_text": "A Guest of a Member must present their Guest Card, print the name and account number of the sponsoring Member, then print and sign the Guest’s name if using a Member account.",
        "summary_text": "Guests must present a guest card and register with the sponsoring member's account details."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 10,
        "source_text": "FITNESS CENTER RULES AND REGULATIONS REGISTRATION: All Members and guests must sign the Informed Consent Waiver before using the Fitness Center.",
        "summary_text": "All users of the fitness center (members or guests) must sign a waiver before use."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 14,
        "source_text": "Children ages 15 and older are permitted to use the facility without parental supervision after successfully completing the Junior Fitness Certification and providing a signed waiver.",
        "summary_text": "Children 15 or older may use the fitness center unsupervised after completion of junior certification and a waiver."
      },
      {
        "source_document": "RULES AND REGULATIONS.pdf",
        "source_page": 29,
        "source_text": "The croquet lawn closes at sundown.",
        "summary_text": "The croquet lawn is closed after sundown."
      },
      {
        "source_document": "FINANCIAL POLICIES 1.pdf",
        "source_page": 5,
        "source_text": "Subsequent Offenses: Privileges suspended until 30 days after the overdue account is paid in full.",
        "summary_text": "For delinquent accounts, membership privileges are suspended until 30 days after the account is paid."
      },
      {
        "source_document": "CHARTERS 1.pdf",
        "source_page": 10,
        "source_text": "Mission: To ensure that The Plantation’s visual aesthetic continuity and property values are protected.",
        "summary_text": "The architectural committee's mission is to preserve the community's visual continuity and property values."
      }
    ]
  }