[
  [
    0.4684,
    "[C-Bylaws_1_0]\n- References to “Association,” “Board,” “Member,” etc.",
    [
      "bylaws_1_0"
    ]
  ],
  [
    0.6436,
    "[C-Bylaws_1_1]\n\n### Article II: Membership\n- All Lot owners, as defined in the Declaration, are automatically members of the association.",
    [
      "bylaws_1_1"
    ]
  ],
  [
    0.5022,
    "[C-Bylaws_2_0]\n- Each lot entitles one membership and one vote; regardless of number of owners, votes are cast as one group per lot.",
    [
      "bylaws_2_0"
    ]
  ],
  [
    0.4862,
    "[C-Bylaws_2_1]\n- Membership is not transferable separately from the Lot ownership.",
    [
      "bylaws_2_1"
    ]
  ],
  [
    0.4742,
    "[C-Bylaws_2_2]\n- Joint owners vote by majority vote of co-owners or as they agree; seniors or spouses may transfer voting rights among themselves.",
    [
      "bylaws_2_2"
    ]
  ],
  [
    0.5202,
    "[C-Bylaws_2_3]\n- Members in good standing are entitled to use common facilities subject to compliance and any guest limits.",
    [
      "bylaws_2_3"
    ]
  ],
  [
    0.3856,
    "[C-Bylaws_3_0]\n- Special meetings may be called by the president, Board or petition of a specified minimum percentage of members.",
    [
      "bylaws_3_0"
    ]
  ],
  [
    0.3501,
    "[C-Bylaws_3_1]\n- Notice (including time and place) of any member meeting must be mailed or delivered at least the minimum number of days required by Florida statute.",
    [
      "bylaws_3_1"
    ]
  ],
  [
    0.3387,
    "[C-Bylaws_3_2]\n- A quorum is established at the meeting (typically a majority of votes present in person or by proxy).",
    [
      "bylaws_3_2"
    ]
  ],
  [
    0.3691,
    "[C-Bylaws_3_3]\n- If a quorum is not present, the meeting may be adjourned to a later date without further notice, where those present constitute a quorum.",
    [
      "bylaws_3_3"
    ]
  ],
  [
    0.4362,
    "[C-Bylaws_4_0]\n- Directors are elected at annual meetings for staggered term(s) of specified lengths (commonly two years per term).",
    [
      "bylaws_4_0"
    ]
  ],
  [
    0.4053,
    "[C-Bylaws_4_1]\n- A director’s term typically begins immediately after election and ends at the next annual meeting after term expiration.",
    [
      "bylaws_4_1"
    ]
  ],
  [
    0.3526,
    "[C-Bylaws_4_2]\n- If the number of directors is changed (subject to vote), the terms are adjusted so approximately half are elected each year.",
    [
      "bylaws_4_2"
    ]
  ],
  [
    0.3697,
    "[C-Bylaws_4_3]\n- Vacancies on the Board (due to resignation, removal, or death) are filled by the remaining directors until the next election.",
    [
      "bylaws_4_3"
    ]
  ],
  [
    0.3582,
    "[C-Bylaws_5_0]\n- The President acts as chief executive officer, U often chairs meetings, executes contracts and represents the Association.",
    [
      "bylaws_5_0"
    ]
  ],
  [
    0.2419,
    "[C-Bylaws_5_1]\n- The Vice President assists the President and performs duties in the President’s absence.",
    [
      "bylaws_5_1"
    ]
  ],
  [
    0.3311,
    "[C-Bylaws_5_2]\n- The Secretary is responsible for keeping minutes of all meetings, issuing notices, and maintaining official records.",
    [
      "bylaws_5_2"
    ]
  ],
  [
    0.3167,
    "[C-Bylaws_5_3]\n- The Treasurer is responsible for maintaining financial books, preparing budgets, financial statements and ensuring that funds are properly managed.",
    [
      "bylaws_5_3"
    ]
  ],
  [
    0.3525,
    "[C-Bylaws_6_0]\n- Committee members need not be directors (except certain committees may require a director or officer as chair).",
    [
      "bylaws_6_0"
    ]
  ],
  [
    0.2983,
    "[C-Bylaws_6_1]\n- Committees serve at the Board’s pleasure and follow tasks delegated by the Board or Bylaws.",
    [
      "bylaws_6_1"
    ]
  ],
  [
    0.3596,
    "[C-Bylaws_6_2]\n\n### Article VII: Finance and Assessments\n- The fiscal year of the association is established (commonly the calendar year).",
    [
      "bylaws_6_2"
    ]
  ],
  [
    0.2691,
    "[C-Bylaws_7_0]\n- The Board must prepare and adopt an annual budget of revenues and expenses before the start of each fiscal year.",
    [
      "bylaws_7_0"
    ]
  ],
  [
    0.3533,
    "[C-Bylaws_7_1]\n- Members must be given notice of the budget and how assessments are determined.",
    [
      "bylaws_7_1"
    ]
  ],
  [
    0.4041,
    "[C-Bylaws_7_2]\n- Regular annual assessment amounts are collected in installments or one payment, as determined by the Board.",
    [
      "bylaws_7_2"
    ]
  ],
  [
    0.3404,
    "[C-Bylaws_7_3]\n- Special assessments (for unbudgeted expenses or major projects) require approval by a specified quorum of members (often two-thirds of votes cast).",
    [
      "bylaws_7_3"
    ]
  ],
  [
    0.3793,
    "[C-Bylaws_8_0]\n- Accurate membership and voting lists, copies of the Declaration, Bylaws, rules, and minutes of meetings must be kept at the principal office.",
    [
      "bylaws_8_0"
    ]
  ],
  [
    0.3165,
    "[C-Bylaws_8_1]\n- Members may inspect records (including accounting books) during normal business hours, subject to reasonable notice and certain limitations.",
    [
      "bylaws_8_1"
    ]
  ],
  [
    0.3215,
    "[C-Bylaws_8_2]\n\n### Article IX: Indemnification and Liability\n- The Association must indemnify and hold harmless directors, officers, and committee members from liability for acts performed in good faith in their official capacities, as permitted by Florida law.",
    [
      "bylaws_8_2"
    ]
  ],
  [
    0.2941,
    "[C-Bylaws_9_0]\n- Insurance (D&O insurance) for directors and officers may be maintained for further protection.",
    [
      "bylaws_9_0"
    ]
  ],
  [
    0.455,
    "[C-Bylaws_9_1]\n\n### Article X: Amendment of Bylaws\n- The Bylaws may be amended by a two-thirds vote of the Board or by a majority (or required percentage) of members voting in a properly noticed meeting as provided by statute.",
    [
      "bylaws_9_1"
    ]
  ],
  [
    0.5877,
    "[C-Bylaws_10_0]\n- Proposed amendments must be announced to members prior to the vote.",
    [
      "bylaws_10_0"
    ]
  ],
  [
    0.4379,
    "[C-Bylaws_10_1]\n\n## Part IV: Rules and Regulations\n\n### Article I: General Use of Common Facilities\n- Only members in good standing (and their accompanied guests) may use community facilities.",
    [
      "bylaws_10_1"
    ]
  ]
]